# Chap_10文件和异常

# 10.1从文件中读取数据

# 10.1.1读取整个文件

# 10.1.2文件路径

# 10.1.3逐行读取

# 10.1.4创建一个包含文件各行内容的列表

# 10.1.5使用文件的内容

# 10.1.6包含一百万位的大型文件

# 10.1.7圆周率值中包含你的生日吗？

# 10.2写入文件

# 10.2.1写入空文件

# 10.2.2写入多行

# 10.2.3附加到文件

# 10.3异常

# 10.3.1处理ZeroDivision异常

# 10.3.2使用try-except代码块

# 10.3.3使用异常避免崩溃

# 10.3.4else代码块

# 10.3.5处理FileNotFoundError异常

# 10.3.6分析文本

# 10.3.7使用多个文件

# 10.3.8失败时一声不吭

# 10.3.9 决定报告哪些错误

# 10.4存储数据

# 10.4.1使用json.dump()和json.load()

# 10.4.2保存和读取用户生成的数据

# 10.4.3重构

# 10.5小结
